#Напишите программу, которая принимает два целых числа a и b, а затем выводит их сумму, разность и произведение.
#Пример вывода для a = 5, b = 10:
# Вывод: 15 -5 50


a = 5
b = 10

print(a+b)
print(a -b)
print(a * b)