# Даны два числа: x = 0, y = 10. Напишите программу, которая вычисляет и выводит результат следующего выражения:
# Формула x - y/1 + x * y
#Вывод -10
x = 0
y = 10

print(x - y / 1 + x * y)