#Напишите программу, которая принимает два числа a и b и вычисляет их среднее арифметическоеи
# среднее геометрическое (квадратный корень из произведения).
# Пример вывода для a = 40, b = 30:
import math

a = 40
b = 30

print((a + b) / 2, math.sqrt(a * b))
